<script setup>
import { computed, ref, reactive, watch, onMounted } from 'vue'
import { Swiper, SwiperSlide } from 'swiper/vue'
import { Pagination, Navigation } from 'swiper/modules'

import _ from 'lodash'

import 'swiper/css'
import 'swiper/css/navigation'
import 'swiper/css/pagination'

const swiperInstance = ref(null)

const onSwiper = (swiper) => {
  swiperInstance.value = swiper
}

const modules = [Pagination, Navigation]

onMounted(() => {
  questions.value.forEach((question) => {
    question.opt = _.shuffle(question.opt)
  })
})

const questions = ref([
  {
    id: 2001,
    template: ``,
    redText: '',
    after: '',
    img: '2001.jpg'
  },
  {
    id: 3002,
    text: 'Нужно измерить расстояние на карте между линиями координатной сетки и определить, через какое количество километров проведены эти линии',
    redText: 'ПО КООРДИНАТНОЙ СЕТКЕ',
    after: '',
    img: '3002.jpg'
  },
  {
    id: 3003,
    text: 'Нужно измерить расстояние на карте между линиями координатной сетки и определить, через какое количество километров проведены эти линии',
    redText: 'ПО КООРДИНАТНОЙ СЕТКЕ',
    after: '',
    img: '3003.jpg'
  },
  {
    id: 3004,
    text: 'Нужно измерить расстояние на карте между линиями координатной сетки и определить, через какое количество километров проведены эти линии',
    redText: 'ПО КООРДИНАТНОЙ СЕТКЕ',
    after: '',
    img: '3004.jpg'
  },
  {
    id: 3005,
    text: 'Нужно измерить расстояние на карте между линиями координатной сетки и определить, через какое количество километров проведены эти линии',
    redText: 'ПО КООРДИНАТНОЙ СЕТКЕ',
    after: '',
    img: '3005.jpg'
  },
  {
    id: 3006,
    text: 'Нужно измерить расстояние на карте между линиями координатной сетки и определить, через какое количество километров проведены эти линии',
    redText: 'ПО КООРДИНАТНОЙ СЕТКЕ',
    after: '',
    img: '3006.jpg'
  },
  {
    id: 3007,
    text: 'Например, если на карте имеется дорога с километровыми столбами, то масштаб удобнее всего определять по расстоянию между ними.',
    redText: 'ПО РАССТОЯНИЯМ МЕЖДУ МЕСТНЫМИ ОБЪЕКТАМ.',
    after: 'УСЛОВНЫЙ ЗНАК «КИЛОМЕТРОВЫЙ СТОЛБ»',
    img: '3007.jpg'
  }
])
</script>

<template>
  <div class="fill">
    <swiper
      :modules="modules"
      :slides-per-view="1.1"
      :loop="false"
      :space-between="80"
      :centered-slides="true"
      :pagination="true"
      @swiper="onSwiper"
      navigation
    >
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <p>
              Склонение на 1990г. восточное 6' 15'(1-04). Среднее сближение меридианов западное 2'21'(0-39). При
              прикладывании буссоли (компаса) к вертикальным линиям координатной сетки среднее отклонение магнитной
              стрелки восточное 8'36'(1-43). Годовое изменение склонение восточное 0'02'[0-01). Поправка в дирекционный
              угол при переходе к магнитному азимуту минус [1-43). Примечание. В скобках показаны деления угломера (одно
              деление угломера 3,6').
            </p>
            <div>
              <span class="text-bold">Крутизна ската КС</span
              ><span>
                – называется угол наклона ската к горизонтальной плоскости. Чем больше угол, тем скат круче.</span
              >
            </div>

            <p>
              Крутизна ската карте определятся по заложению. Для определения крутизны ската надо измерить расстояние
              между горизонталями циркулем, найти соответствующий отрезок на шкале заложений и прочитать число градусов.
              На крутых скатах это расстояние измеряется между утолщенными, горизонталями и крутизна ската определяется
              по шкале, расположенной справа. Крутизну ската можно определить приближенно по формуле:
            </p>
            <div class="formula">
              <div class="formula-row">
                <div>&alpha;</div>
                <div>&deg;</div>
                <div>=</div>
              </div>
              <div class="divide">
                <div class="divide-up">
                  <div>60</div>
                  <div>&deg;</div>
                  <div>h</div>
                </div>
                <div class="divide-down"><div>d</div></div>
              </div>
            </div>
            <p>h -высота ската (относительное превышение) d -заложение ската</p>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <h3 class="text-bold">Определение географических координат.</h3>
            <p>
              Географические координаты-угловые величины (широта φ и долгота λ), определяющие положение точки на земной
              поверхности. Рамка топографической карты разбита на минуты, которые разделены точками на деления по 10
              секунд в каждом. На боковых сторонах рамки обозначены широты, а на северной и южной-долготы.
            </p>
            <p>Пользуясь минутной рамкой карты можно:</p>
            <p>1.Определить географические координаты любой точки на карте.</p>
            <p>
              Например, координаты точки <span class="text-bold">А</span>. Для этого необходимо с помощью
              циркуля-измерителя измерить кратчайшее расстояние от точки <span class="text-bold">А</span> до южной рамки
              карты, затем приложить измеритель к западной рамке и определить количество минут и секунд в измеренном,
              отрезке, сложить полученное значение минут и секунд (О' 40") с широтой юго-западного угла рамки-54°40'
              54°40'+О'40"=54'40'40" Долгота определяется аналогично.
            </p>
            <p>
              Измеряют с помощью циркуля- измерителя кратчайшее расстояние от точки <span class="text-bold">А</span> до
              западной рамки карты прикладывают циркуль-измеритель к южной рамке, определяют количество минут и секунд в
              измеренном отрезке (0'42") складывают полученное значение с долготой юго-западного угла рамки-18'00'.
              18"00' +О'42"=18"00' 42"
            </p>
            <p>2. Нанести любую ·точку на карту по заданным географическим координатам.</p>
            <p>
              Например, точку <span class="text-bold">Б</span> широта: 54"40'15", долгота 18°03'56". Для нанесения на
              карту точки по долготе необходимо провести истинный меридиан через данную точку, для чего соединить
              одинаковое количество минут по северной и южной рамке; для нанесения на карту точки по широте необходимо
              провести параллель через данную точку, для чего соединить одинаковое количество минут по западной и
              восточной рамке. Пересечение двух прямых определит местоположение точки <span class="text-bold">Б</span>.
            </p>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <h3 class="text-bold">Построение профиля</h3>
            <p>Прямая НП-U не пересекает изображение профиля, значит видимость между НП и цель есть.</p>
            <p>
              Профиль-чертеж, изображающий разрез местности вертикальной плоскостью. Для большей выразительности рельефа
              местности вертикальный масштаб профиля принимается в 10 или, более раз крупнее горизонтального. В связи с
              этим профиль, передавая взаимное превышение точек, искажает (увеличивает) крутизну скатов.
            </p>
            <p>Для построения профиля нужно:</p>
            <ul>
              <li>
                прочертить на карте профильную линию, приложить к ней лист разграфленной (миллиметровой) бумаги,
                перенести на ее край короткими черточками, места горизонталей, точки перегиба скатов и местные предметы,
                которые сечет профильная линия и подписать их высоты;
              </li>
              <li>
                подписать на листе разграфленной бумаги горизонтальных линий высоты, соответствующие высотам
                горизонталей на карте, приняв условно промежутки между этими линиями за высоту сечения (установить
                вертикальный масштаб);
              </li>
              <li>
                от всех черточек, обозначающих места пересечения профильной линии с отметками высот горизонталей, точек
                перегиба скатов и местных предметов, опустить перпендикуляры до пересечения их с соответствующими по
                отметкам параллельными линиями и отметить полученные точки пересечения;
              </li>
              <li>соединить точки пересечения плавной кривой, которая и изобразит профиль местности.</li>
            </ul>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <h3 class="text-bold">Определение прямоугольных координат</h3>
            <p>
              <span class="text-bold">Прямоугольные</span> координаты-линейные величины (абсцисса
              <span class="text-bold">Х</span>, ордината <span class="text-bold">Y</span>), определяющие положение точки
              на плоскости (карте).
            </p>
            <p>
              Координатная (километровая) сетка-система горизонтальных н вертикальных лини, ·проведенных параллельно
              осям прямоугольных координат (осевому меридиану зоны и экватору).
            </p>
            <p>
              Координатная сетка оцифрована. Подписи у горизонтальных линий указывают расстояния в километрах от
              экватора, у вертикальных линий означают номер зоны (одна или две цифры) и расстояние в километрах (всегда
              три) от осевого меридиана зоны, условно вынесенного· к западу на 500 км.
            </p>
            <p>
              На внешней рамке даны выходы координатных линий (дополнительная сетка) системы координат смежной зоны.
            </p>
            <p>По координатной сетке с помощью циркуля (линейки) можно:</p>
            <p>Определить прямоугольные координаты точки на карте.</p>
            <p>Например, точки <span class="text-bold">В</span>.</p>
            <p>Для этого надо:</p>
            <ul>
              <li>
                записать <span class="text-bold">Х</span>-оцифровку нижней километровой линии квадрата, в котором
                находится точка <span class="text-bold">В</span>, т. е. 6065 км;
              </li>
              <li>
                измерить по перпендикуляру расстояние от нижней километровой линии квадрата до точки
                <span class="text-bold">В</span> и, пользуясь линейным масштабом карты, определить величину этого
                отрезка в метрах;
              </li>
              <li>
                сложить измеренную величину 540 м с значением оцифровки нижней километровой линии квадрата
                <p class="text-bold">Х = 6065000 + 540 = 6065540м</p>
              </li>
            </ul>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <p>Определение ординаты <span class="text-bold">Y</span> производят аналогично т.е.</p>
            <ul>
              <li>
                записать значение <span class="text-bold">Y</span> - оцифровку левой вертикальной линии квадрата, т. е.
                4308;
              </li>
              <li>
                измерить по перпендикуляру расстояние от этой линии до точки <span class="text-bold">В</span>, т. ч. 710
                м;
              </li>
              <li>
                прибавить измеренное расстояние к· значению оцифровки <span class="text-bold">Y</span> левой
                вертикальной линии квадрата
                <p class="text-bold">Y = 4308000 + 710 = 4308710м</p>
              </li>
            </ul>
            <p>2. Нанести на карту цель по заданным координатам</p>
            <p>
              Например, точку <span class="text-bold">Г</span> по координатам: <span class="text-bold">Х</span>=6064670
              <span class="text-bold">Y</span>=4310690, для этого надо:
            </p>
            <ul>
              <li>
                найти квадрат, в котором расположена точка <span class="text-bold">Г</span> по значению целых
                километров, т.е. 6410;
              </li>
              <li>
                отложить от левого верхнего угла квадрата отрезок в масштабе карты, равный разности абсциссы цели и
                верхней стороны квадрата - 330м
              </li>
              <li>
                от полученной точки ·по перпендикуляру вправо отложить отрезок, равный разности ординат ·цели и левой
                стороны квадрата, т. е. 690 м.
              </li>
            </ul>
            <p>3. Произвести целеуказание по карте, т. е. указать квадрат, в котором расположена цель.</p>
            <p>
              Форма целеуказания: оцифровка по вертикали­ нижняя горизонтальная линия квадрата (ось
              <span class="text-bold">Х</span>) и оцифровка по горизонтали, левая вертикальная линия квадрата (ось
              <span class="text-bold">Y</span>).
            </p>
            <p>Например: геопункт 171,8-6610</p>
            <p>
              Для, более точного определения указывают часть квадрата, деля его на 4 части и обозначают каждую часть
              буквами.
            </p>
            <p>
              Например, леснич. 6511-Г или на 9 частей улитка), обозначая их цифрами, например,
              <span>геопункт <br />214,3-6507-8</span>
            </p>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <h3 class="text-bold">АЗИМУТ</h3>
            <p>
              Истинный азимут (Аи) -горизонтальный угол, измеряемый по ходу часовой стрелки от 0° до 360° между северным
              направлением истинного меридиана данной точки и направлением на объект.
            </p>
            <p>
              Магнитный азимут (Ам) - горизонтальный угол, измеряемый по ходу часовой стрелки от 0° до 360° между
              северным направлением магнитного меридиана данной точки и направлением на объект.
            </p>
            <p>
              Дирекционный угол (ДУ)-горизонтальный угол, измеряемый по ходу часовой стрелки от 0° до 360° между
              северным направлением вертикальной линии координатной сетки данной точки и направлением на объект.
            </p>
            <p>
              Магнитное склонение (Ск)-угол между северным направлением истинного и магнитного меридианов в данной
              точке. Если магнитная стрелка отклоняется от истинного меридиана к востоку, то склонение восточное
              (учитывается со знаком +), при отклонении магнитной стрелки к западу- западное (учитывается со знаком -).
            </p>
            <p>
              Сближение меридианов (Сб) угол между северным направлением истинного меридиана и вертикальной линией
              координатной сетки в данной точке. Если вертикальная линия сетки отклоняется к востоку от истинного
              меридиана, то сближение восточное (учитывается со знаком +), при отклонении линии сетки к западу западное
              (учитывается со знаком -).
            </p>
            <p>
              Поправка направления (ПН): - угол между северным направлением вертикальной линии координатной сетки и
              направлением магнитного меридиана. Она равна алгебраической разности магнитного склонения и сближения
              меридианов ПН = (±O)-, (±У)
            </p>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <h3 class="text-bold">Определение азимутов и дирекционных углов</h3>
            <p>
              Сущность движения по азимутам состоит в умении определить и выдержать с помощью компаса или
              гирополукомпаса заданное направление движения и точно выйти к намеченному объекту в условиях плохой
              видимости (ночью, в туман, снегопад, в лесу, тундре н т. п.).
            </p>
            <p>Для движения по азимуту нужно подготовить данные по карте:</p>
            <ul>
              <li>выбрать и изучить маршрут движения;</li>
              <li>наметить легкоопознаваемые ориентиры и соединить между собой прямыми линиями;</li>
              <li>измерить дирекционные углы и перевести их в магнитные азимуты;</li>
              <li>измерить расстояние между ориентирами;</li>
              <li>оформить данные для движения на карте, схеме или таблице.</li>
            </ul>
            <br />
            <p>Магнитные азимуты можно определить по карте с помощью компаса:</p>
            <ul>
              <li>ориентировать карту по компасу с учетом магнитного склонения или поправки направления;</li>
              <li>
                положить компас на линию маршрута и· совместить отсчет 0-180° с направлением движения (0° всегда впер д
                по ходу движения);
              </li>
              <li>взять отсчет по северному концу стрелки и вычесть его из 360° (разность- АМ).</li>
            </ul>
          </div>
        </div>
      </swiper-slide>
      <swiper-slide>
        <div class="slide-content">
          <div class="slide-text">
            <h3 class="text-bold">Абсолютная высота</h3>
            <p>
              Абсолютная высота- высота точки земной поверхности, над уровнем моря; определяется, по отметкам высот и
              горизонталей.
            </p>
            <p>Балтийская система высот - система отсчета абсолютных высот от среднего уровня Балтийского моря.</p>
            <p>Горизонталь - линия, соединяющая на карте точки рельефа с равной абсолютной высотой.</p>
            <p>Высота сечения рельефа - расстояние по высоте между двумя смежными секущими плоскостями.</p>
            <p>
              Основные горизонтали (сплошные линии) проводятся на карте, через принятую для данного масштаба высоту
              сечения рельефа;
            </p>
            <p>дополнительные или полугоризонтали (прерывистые линии) через половину высоты сечения;</p>
            <p>
              вспомогательные (короткие прерывистые линии) проводятся на произвольной высоте, для отображения наиболее
              мелких деталей рельефа, которые не выражаются основными или дополнительными горизонталями.
            </p>
            <p>
              <span class="text-bold">Относительная высота</span> (взаимное превыше точек) - высота одной точки
              местности над другой, она определяется как разность абсолютных высот этих то чек.
            </p>
          </div>
        </div>
      </swiper-slide>
    </swiper>
  </div>
</template>

<style scoped>
.swiper {
  width: 900px;
  height: 100%;
  padding: 1% 0;
}

.swiper-slide {
  height: 95%;
  border-radius: 8px;
  box-shadow: 2px 4px 8px grey;
  display: flex;
  align-items: flex-start;
  justify-content: center;
  font-size: 100%;
  padding: 16px;
}

.question-text,
.question-red-text {
  width: 100%;
  margin-bottom: 8px;
  font-size: 100%;
}

.question-red-text {
  color: red;
}

.question-image img {
  max-width: 90%;
  height: 400px;
}

.slide-text {
  text-align: justify;
  display: flex;
  gap: 2px;
  flex-direction: column;
  text-indent: 5%;
}

.slide-text p {
  margin-bottom: 12px;
}

.text-bold {
  font-weight: bold;
}

.formula {
  display: flex;
  align-items: center;
  justify-content: center;
  font-weight: bold;
  font-style: oblique;
  font-size: 150%;
  gap: 6px;
}

.formula-row {
  display: flex;
}

.divide {
  display: flex;
  flex-direction: column;
}

.divide-up,
.divide-down {
  display: flex;
  align-items: center;
  justify-content: center;
}

.divide-up {
  border-bottom: 2px solid rgb(44, 62, 80);
}

li {
  text-indent: 0;
}

@media screen and (min-width: 1800px) {
  .swiper {
    width: 1600px;
    height: 100%;
    padding: 1% 0;
  }

  .question-image img {
    height: 500px;
  }
}
</style>
